app/Controllers/compra.php

SELECT *
FROM `carrito`
WHERE `id_usuario` = '3'
---
    public function finalizarCompra()
    {

        $usuario = session()->get('usuario');

        if ($usuario === null) {
            return redirect()->to(base_url('iniciarsesion'));
        }

        $carritoModel     = new \App\Models\carritomodel();
        $productosCarrito = $carritoModel->where('id_usuario', $usuario['id_usuario'])->findAll();

INSERT INTO `venta` (`id_usuario`, `fecha`, `id_datos_envio`) VALUES ('3', '2023-12-06 18:55:21', 70)
---
    public function pagopaypal($provincia, $ciudad, $calle, $codigo_postal, $numero, $piso, $observaciones)
    {
        $usuario = session()->get('usuario');


        $datosEnvioModel   = new \App\Models\DatosEnvioModel();
        $ventaModel        = new \App\Models\ventamodel();
        $detalleVentaModel = new \App\Models\historialcompra();



        $data = [
            'id_usuario'      => $usuario['id_usuario'],
            'provincia'       => $provincia,
            'ciudad'          => $ciudad,
            'calle'           => $calle,
            'codigo_postal'   => $codigo_postal,
            'numero'          => $numero,
            'piso'            => $piso,
            'observaciones'   => $observaciones
        ];

        // Guardar los datos de envío en la base de datos
        $idDatosEnvio = $datosEnvioModel->guardarDatosEnvio($data);




        $idVenta = $ventaModel->insert([
            'id_usuario' => $usuario['id_usuario'],
            'fecha' => date('Y-m-d H:i:s'),
            'id_datos_envio' => $idDatosEnvio
        ]);

SELECT *
FROM `carrito`
WHERE `id_usuario` = '3'
INSERT INTO `detalle_venta` (`id_venta`, `id_producto`, `cantidad`, `precio`) VALUES (42, '34', '1', '5000')
DELETE FROM `carrito`
WHERE `id_usuario` = '3'
---

        $carritoModel = new \App\Models\CarritoModel();
        $modelprod = new \App\Models\modelprod();
        $productosCarrito = $carritoModel->where('id_usuario', $usuario['id_usuario'])->findAll();

        foreach ($productosCarrito as $producto) {

            $detalleVentaModel->insert([
                'id_venta'      => $idVenta,
                'id_producto'   => $producto['id_talle_producto'],
                'cantidad'      => $producto['cantidad'],
                'precio'        => isset($producto['precio']) ? $producto['precio'] : $modelprod->obtenerPrecioProductoPorId($producto['id_talle_producto'])]);
        }


        $carritoModel->where('id_usuario', $usuario['id_usuario'])->delete();