app/Models/callemodel.php

SELECT `id`
FROM `calle`
WHERE `nombre` = 'haiti'
 LIMIT 1
---
    public function obtenerIdCallePorNombre($nombre)
    {
        $result = $this->select('id')->where('nombre', $nombre)->first();