app/Models/ciudadmodel.php

    public function obtenerIdCiudadPorNombre($nombre)
    {
        $result = $this->select('id')->where('nombre', $nombre)->first();
---
SELECT `id`
FROM `ciudad`
WHERE `nombre` = 'rio tercero'
 LIMIT 1