app/Models/modelprod.php

SELECT `precio`
FROM `producto`
WHERE `id_producto` = '34'
---
  public function obtenerPrecioProductoPorId($id_producto)
    {

        $query = $this->db->table('producto')->select('precio')->where('id_producto', $id_producto)->get();